src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <comment>(Общ)</comment>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>ВалютаВзаиморасчетов</name>
    <comment>(Общ) Определяет валюту взаиморасчетов по договору, не может меняться, если по договору проведен хотя бы один документ</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВзаиморасчетов</name>
    <type>
      <types>CatalogRef.ВидыВзаиморасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>(Общ) </comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетыВУсловныхЕдиницах</name>
    <comment>(Регл)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <comment>(Общ) Тип цен по умолчанию для оформления покупок по данному договору</comment>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <comment>Служебный, для объединения с УТ</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВедениеВзаиморасчетов</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ВедениеВзаиморасчетовПоДоговорам</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьСуммуЗадолженности</name>
    <comment>(Упр) </comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопустимаяСуммаЗадолженности</name>
    <comment>(Упр) </comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапрещатьПроведениеПриЗадолженности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПроизводственныйКалендарь</name>
    <type>
      <types>CatalogRef.ПроизводственныеКалендари</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьУсловиеВозникновенияЗадолженности</name>
    <comment>0 - Предоплата, 1 - Доставка груза, 2 - Получение документов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДопустимоеЧислоДнейЗадолженности</name>
    <comment>Отсрочка оплаты по задолженности, дней</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСпособРасчетаДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВидСДПоЗадолженности</name>
    <type>
      <types>CatalogRef.уатВидыСопроводительныхДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВидДокументаПоЗадолженности</name>
    <type>
      <types>CatalogRef.уатВидыДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланированиеОбъемовПеревозок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВидыСопроводительныхДокументов</name>
    <attributes>
      <name>ВидДокумента</name>
      <type>
        <types>CatalogRef.уатВидыСопроводительныхДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>УсловиеКонтроля</name>
      <type>
        <types>EnumRef.уатУсловияКонтроляСопроводительныхДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДнейНаОбработку</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособРасчетаДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроизводственныйКалендарь</name>
      <type>
        <types>CatalogRef.ПроизводственныеКалендари</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктНазначения</name>
      <type>
        <types>CatalogRef.уатПунктыНазначения</types>
      </type>
    </attributes>
    <attributes>
      <name>Грузополучатель</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГрафикОплаты</name>
    <attributes>
      <name>ЭтапОплаты</name>
      <type>
        <types>CatalogRef.уатЭтапыОплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОтсчета</name>
      <type>
        <types>EnumRef.уатВариантыОтсчетаДатыПлатежа</types>
      </type>
    </attributes>
    <attributes>
      <name>Процент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Срок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроизводственныйКалендарь</name>
      <type>
        <types>CatalogRef.ПроизводственныеКалендари</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидСопроводительногоДокумента</name>
      <type>
        <types>CatalogRef.уатВидыСопроводительныхДокументов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Enums/уатВидыВладельцевСопроводительныхДокументов/уатВидыВладельцевСопроводительныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уатВидыВладельцевСопроводительныхДокументов</name>
  <enumValues>
    <name>ДокументыОрганизации</name>
  </enumValues>
  <enumValues>
    <name>ДокументыПеревозчика</name>
  </enumValues>
  <enumValues>
    <name>ДокументыЗаказчика</name>
  </enumValues>
  <enumValues>
    <name>ОбщиеДокументы</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ВедениеВзаиморасчетовПоДоговорам/ВедениеВзаиморасчетовПоДоговорам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВедениеВзаиморасчетовПоДоговорам</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>ПоДоговоруВЦелом</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПоСчетам</name>
    <comment>По счетам</comment>
  </enumValues>
  <enumValues>
    <name>ПоНакладным</name>
  </enumValues>
  <enumValues>
    <name>ПоЗаказамНаТС</name>
  </enumValues>
</mdclass:Enum>

src/Enums/уатВариантыОтсчетаДатыПлатежа/уатВариантыОтсчетаДатыПлатежа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уатВариантыОтсчетаДатыПлатежа</name>
  <enumValues>
    <name>ДоОтправленияПоЗаказу</name>
  </enumValues>
  <enumValues>
    <name>ПослеОтправленияПоЗаказу</name>
  </enumValues>
  <enumValues>
    <name>ДоПрибытияПоЗаказу</name>
  </enumValues>
  <enumValues>
    <name>ПослеПрибытияПоЗаказу</name>
  </enumValues>
  <enumValues>
    <name>ПослеДоставкиГруза</name>
  </enumValues>
  <enumValues>
    <name>ПослеПолученияСопроводительныхДокументов</name>
  </enumValues>
  <enumValues>
    <name>ПроизвольнаяДата</name>
    <comment>Используется при указании даты платежа в накладных вручную (закладка Дополнительно)</comment>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ДоговорыКонтрагентов/ObjectModule.bsl
#Область ОбработчикиСобытий

// Процедура вызывается перед записью элемента справочника.
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоГруппа Тогда
		Если НЕ ЗначениеЗаполнено(Наименование) Тогда 
			Наименование = уатНастройкиШаблонов.СформироватьНаименованиеПоШаблону("Справочник_ДоговорыКонтрагентов", ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьПоСтруктуре(ДанныеЗаполнения);
	КонецЕсли;
	
	Если Не ЭтоГруппа Тогда
		Если Не ЗначениеЗаполнено(ВалютаВзаиморасчетов) Тогда
			ВалютаВзаиморасчетов = Константы.ВалютаРегламентированногоУчета.Получить();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Заполняет реквизиты объекта значениями, полученными в структуре ДанныхЗаполнения.
//	Заполнение возможно только в случае, когда в качестве ДанныхЗаполнения получена структура.
//	Заполнены будут только те реквизиты, для которых в метаданных установлен флаг "ЗаполнятьИзДанныхЗаполнения"
//
//
// Параметры
//  <Объект>  - <СправочникОбъект>, <ДокументОбъект> и т.д. - Заполняемый объект
//  <ДанныеЗаполнения>  - <произвольный тип> - параметр, полученный в ОбработкеЗаполнения объекта
//  <МетаданныеОбъекта>  - <Метаданные> -
//
//
Процедура ЗаполнитьПоСтруктуре(ДанныеЗаполнения) Экспорт

	Если ТипЗнч(ДанныеЗаполнения) <> Тип("Структура")
		ИЛИ ДанныеЗаполнения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МетаданныеОбъекта = ЭтотОбъект.Метаданные();
	
	СтруктураЗаполнения = Новый Структура;
	Для Каждого Реквизит Из МетаданныеОбъекта.СтандартныеРеквизиты Цикл
		Если Реквизит.ЗаполнятьИзДанныхЗаполнения
			И ДанныеЗаполнения.Свойство(Реквизит.Имя) Тогда
			СтруктураЗаполнения.Вставить(Реквизит.Имя);
		КонецЕсли;
	КонецЦикла;
	Для Каждого Реквизит Из МетаданныеОбъекта.Реквизиты Цикл
		Если Реквизит.ЗаполнятьИзДанныхЗаполнения
			И ДанныеЗаполнения.Свойство(Реквизит.Имя) Тогда
			Если (ЭтотОбъект.ЭтоГруппа И Реквизит.Использование <> Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляЭлемента)
				ИЛИ
				(НЕ ЭтотОбъект.ЭтоГруппа И Реквизит.Использование <> Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляГруппы)
				Тогда
				СтруктураЗаполнения.Вставить(Реквизит.Имя);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	ЗаполнитьЗначенияСвойств(СтруктураЗаполнения, ДанныеЗаполнения);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтруктураЗаполнения);

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ЭтоГруппа Тогда
		Если ПолучитьФункциональнуюОпцию("уатИспользоватьДокументооборот") Тогда
			Для Каждого ТекСтрока Из ВидыСопроводительныхДокументов Цикл
				НомСтр = Формат(ТекСтрока.НомерСтроки, "ЧН=0; ЧГ=0");
				
				Если ТекСтрока.СпособРасчетаДней = 1 И НЕ ЗначениеЗаполнено(ТекСтрока.ПроизводственныйКалендарь) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке №" + НомСтр
						+ " табличной части ""Виды сопроводительных документов"" не указан производственный календарь",
						ЭтотОбъект,
						"ВидыСопроводительныхДокументов[" + НомСтр + "].ПроизводственныйКалендарь",,
						Отказ);
				КонецЕсли;
				Если ТекСтрока.ВидДокумента.ВидВладельца = Перечисления.уатВидыВладельцевСопроводительныхДокументов.ДокументыОрганизации Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке №" + НомСтр
						+ " табличной части ""Виды сопроводительных документов"" указан вид документа с типом ""Документы организации""",
						ЭтотОбъект,
						"ВидыСопроводительныхДокументов[" + НомСтр + "].ВидДокумента",,
						Отказ);
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;
	
		Если ПолучитьФункциональнуюОпцию("уатИспользоватьПлатежныйКалендарь")
			И ВедениеВзаиморасчетов <> Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом Тогда
			
			Если ГрафикОплаты.Итог("Процент") > 100 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Общий процент в графике оплаты не должен превышать 100%",,,, Отказ);
			КонецЕсли;
			
			мсвВариантыОтсчета = Новый Массив;
			мсвЭтапыОплаты     = Новый Массив;
			Для Каждого ТекСтрока Из ГрафикОплаты Цикл
				НомСтр = Формат(ТекСтрока.НомерСтроки, "ЧН=0; ЧГ=0");
				
				Если мсвВариантыОтсчета.Найти(ТекСтрока.ВариантОтсчета) <> Неопределено
					ИЛИ мсвЭтапыОплаты.Найти(ТекСтрока.ЭтапОплаты) <> Неопределено Тогда
					
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
						"В табличной части ""График оплаты"" не должно быть строк с повторящимся этапом оплаты (включая пустые) или вариантом отсчета.",
						ЭтотОбъект,
						"ГрафикОплаты[" + НомСтр + "]",,
						Отказ);
					Прервать;
				Иначе
					мсвВариантыОтсчета.Добавить(ТекСтрока.ВариантОтсчета);
					мсвЭтапыОплаты.Добавить(ТекСтрока.ЭтапОплаты);
				КонецЕсли;
				
				Если ТекСтрока.ВариантОтсчета = Перечисления.уатВариантыОтсчетаДатыПлатежа.ПослеПолученияСопроводительныхДокументов
					И НЕ ЗначениеЗаполнено(ТекСтрока.ВидСопроводительногоДокумента) Тогда
											
					Если ГрафикОплаты.Количество() = 1 Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
							"Не заполнен вид сопроводительных документов в графике оплаты",,,, Отказ);
					Иначе
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
							"Не заполнена колонка ""Вид сопроводительных документов"" в строке " + НомСтр + " списка ""График оплаты""",
							ЭтотОбъект, "ГрафикОплаты[" + НомСтр + "].ВидСопроводительногоДокумента",, Отказ);
					КонецЕсли;
				КонецЕсли;
				Если ТекСтрока.ВариантОтсчета.Пустая() Тогда
					Если ГрафикОплаты.Количество() = 1 Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
							"Не заполнен вариант отсчета в графике оплаты",,,, Отказ);
					Иначе
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
							"Не заполнена колонка ""Вариант отсчета"" в строке " + НомСтр + " списка ""График оплаты""",
							ЭтотОбъект, "ГрафикОплаты[" + НомСтр + "].ВариантОтсчета",, Отказ);
					КонецЕсли;
				КонецЕсли;
				Если ТекСтрока.Процент = 0 Тогда
					Если ГрафикОплаты.Количество() = 1 Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
							"Не заполнен процент оплаты в графике оплаты",,,, Отказ);
					Иначе
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
							"Не заполнена колонка ""Процент"" в строке " + НомСтр + " списка ""График оплаты""",
							ЭтотОбъект, "ГрафикОплаты[" + НомСтр + "].Процент",, Отказ);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
